#Дано положительное действительное число X. Выведи его дробную часть.
x=float(input())
print(x-int(x))